{
    "_id": 499244,
    "companyLogo": "https://i.ibb.co/nc4LN1j/weta.png",
    "jobTitle": "DevOps Engineer",
    "companyName": "Weta Digital",
    "workLocation": "Remote",
    "location": "Dublin, Ireland",
    "timeType": "Part time",
    "salary": 82000,
    "description": "Developing and maintaining the infrastructure that supports software development, testing, and deployment. They work closely with software developers, system administrators, and other IT professionals to design, implement, and maintain automated deployment pipelines, build and release management systems, and monitoring and logging tools. They use scripting languages, configuration management tools, and cloud services to automate and streamline the deployment and management of applications, and ensure that systems are secure, reliable, and scalable. They also troubleshoot and resolve issues related to system and software deployments, and continuously improve the performance, efficiency, and reliability of software development and deployment processes.",
    "responsibility": "Design, implement, and maintain automated deployment pipelines and build/release management systems Develop and maintain scripts and automation tools for system and software deployment, monitoring, and management Implement and manage configuration management tools, such as Ansible, Puppet, or Chef Work with software developers to ensure that applications are deployable, scalable, and secure Ensure that systems are continuously monitored for performance, security, and reliability Troubleshoot and resolve issues related to system and software deployments Continuously improve the performance, efficiency, and reliability of software development and deployment processes Keep up-to-date with emerging trends and technologies in DevOps and apply them to enhance the system and software deployment processes.",
    "educationalRequirements": "B.Sc in Computer Science",
    "experience": "3 years",
    "contactInformation": {
        "phone": "330-501-2033",
        "email": "jobs@wetadigital.com"
    }
}